run/OFW2025/case2/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "$FOAM_CASE/caseInfo"

convertToMeters 1;

vertices
(
    ($x1 0  $z2)
    ($x2 0  $z2)
    ($x2 $y $z2)
    ($x1 $y $z2)
    ($x1 0  $z1)
    ($x2 0  $z1)
    ($x2 $y $z1)
    ($x1 $y $z1)
    ($x1 0  $z3)
    ($x1 $y $z3)
    ($x2 0  $z3)
    ($x2 $y $z3)
);

blocks
(
    hex (0 1 2 3 8 10 11 9) ($nx 1 $nz) simpleGrading (1 1 1)
    hex (8 10 11 9 4 5 6 7  ) ($nx 1 $nzs) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    seaBed
    {
        type wall;
        faces
        (
            (4 5 6 7)
        );
    }

    frontBack
    {
        type empty;
        faces
        (
            (3 9 11 2)
            (0 1 10 8)
            (9 7 6 11)
            (8 4 5 10)
        );
    }

    soilDomainBottom
    {
        type wall;
        faces
        (
            (0 3 2 1 )
        );
    }

    sides
    {
        type cyclic;
        faces
        (
            (0 8 9 3)
            (8 4 7 9)
            (1 10 11 2)
            (10 5 6 11)
        );

    }
);


mergePatchPairs
(
);

// ************************************************************************* //
