run/OFW2025/case2/Allrun
#!/bin/sh
# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication blockMesh
runApplication setSet < batch.setSet  
runApplication setsToZones -noFlipMap
runApplication residualLiquefactionFoam &

